//测试函数
#include "app.h"

//测试添加线上预约挂号信息
void test_add_on_line() {
    add_on_line(1, "张三", "内科", "2024-06-01 09:00");
    add_on_line(2, "李四", "外科", "2024-06-01 10:00");
    add_on_line(3, "王五", "儿科", "2024-06-01 11:00");
    add_on_line(4, "赵六", "妇科", "2024-06-01 13:00");
    add_on_line(5, "钱七", "眼科", "2024-06-01 14:00");
    add_on_line(6, "孙八", "内科", "2024-06-01 15:00");
    add_on_line(7, "周九", "外科", "2024-06-01 16:00");
    add_on_line(8, "吴十", "儿科", "2024-06-01 17:00");
    add_on_line(9, "郑十一", "眼科", "2024-06-01 18:00");
    add_on_line(10, "冯十二", "儿科", "2024-06-01 19:00");
    add_on_line(11, "陈十三", "眼科", "2024-06-01 20:00");
    add_on_line(12, "褚十四", "眼科", "2024-06-01 21:00");
    add_on_line(13, "卫十五", "眼科", "2024-06-01 22:00");
    add_on_line(14, "蒋十六", "眼科", "2024-06-01 23:00");
    add_on_line(15, "沈十七", "眼科", "2024-06-02 09:00");
    add_on_line(16, "韩十八", "眼科", "2024-06-02 10:00");
    add_on_line(17, "杨十九", "眼科", "2024-06-02 11:00");
    add_on_line(18, "朱二十", "眼科", "2024-06-02 13:00");
    add_on_line(19, "秦二十一", "外科", "2024-06-02 14:00");
    add_on_line(20, "尤二十二", "外科", "2024-06-02 15:00");
    add_on_line(21, "许二十三", "内科", "2024-06-02 16:00");
    add_on_line(22, "何二十四", "外科", "2024-06-02 17:00");
    add_on_line(23, "吕二十五", "儿科", "2024-06-02 18:00");
    add_on_line(24, "施二十六", "妇科", "2024-06-02 19:00");
    add_on_line(25, "张二十七", "眼科", "2024-06-02 20:00");
    add_on_line(26, "孔二十八", "外科", "2024-06-02 21:00");
    add_on_line(27, "曹二十九", "妇科", "2024-06-02 22:00");
    add_on_line(28, "严三十", "妇科", "2024-06-02 23:00");
    add_on_line(29, "华三十一", "妇科", "2024-06-03 09:00");
    add_on_line(30, "金三十二", "神妇科", "2024-06-03 10:00");
    add_on_line(31, "魏三十三", "妇科", "2024-06-03 11:00");
    add_on_line(32, "陶三十四", "妇科", "2024-06-03 13:00");
    add_on_line(33, "姜三十五", "妇科", "2024-06-03 14:00");
    add_on_line(34, "戚三十六", "妇科", "2024-06-03 15:00");
    add_on_line(35, "谢三十七", "妇科", "2024-06-03 16:00");
    add_on_line(36, "邹三十八", "妇科", "2024-06-03 17:00");
    add_on_line(37, "喻三十九", "妇科", "2024-06-03 18:00");
    add_on_line(38, "柏四十", "外科", "2024-06-03 19:00");
    add_on_line(39, "水四十一", "外科", "2024-06-03 20:00");
    // add_on_line(40, "窦四十二", "外科", "2024-06-03 21:00");
}
//测试签到线上预约挂号
void test_sign_in_on_line() {
    for (int i = 0; i < 40; i++) {
        sign_in_on_line(i + 1);
    }
}

//打印签到队列
void print_sign_up_queue() {
    printf("=============签到队列：\n");
    int i = sign_up_front;

        // 空队列判断
    if(i == sign_up_rear) {
        printf("当前无已签到患者\n");
        return;
    }
    while(i != sign_up_rear) {
        if (sign_up_queue[i].number != 0) {
            printf("取号顺序：%d\t姓名：%s\t科室：%s\t是否需要复诊：%d\n",
                   sign_up_queue[i].number, sign_up_queue[i].name, sign_up_queue[i].admission, sign_up_queue[i].sub);
        }
        i = (i + 1) % ON_LINE_SIZE;
    }
}